package declension

import "github.com/dshipenok/gomorphos/str"

const (
	FirstDeclension  = 1
	SecondDeclension = 2
	ThirdDeclension  = 3
)

type Gender string
type Case int //string

const (
	Neuter Gender = "neuter"
	Male          = "male"
	Female        = "female"
)

const (
	Imenit  Case = 0 //"imenit"
	Rodit        = 1 //"rodit"
	Dat          = 2 //"dat"
	Vinit        = 3 //"vinit"
	Tvorit       = 4 //"tvorit"
	Predloj      = 5 //"predloj"
)

var immutableWords = str.NewWordSet([]string{
	// валюты
	"евро", "пенни", "песо", "сентаво",
	// на а
	"боа", "бра", "фейхоа", "амплуа", "буржуа",
	// на о
	"манго", "какао", "кино", "трюмо", "пальто", "бюро", "танго", "вето", "бунгало", "сабо", "авокадо", "депо", "панно",
	// на у
	"зебу", "кенгуру", "рагу", "какаду", "шоу",
	// на е
	"шимпанзе", "конферансье", "атташе", "колье", "резюме", "пенсне", "кашне", "протеже", "коммюнике", "драже", "суфле", "пюре", "купе", "фойе", "шоссе", "крупье",
	// на и
	"такси", "жалюзи", "шасси", "алиби", "киви", "иваси", "регби", "конфетти", "колибри", "жюри", "пенальти", "рефери", "кольраби",
	// на э
	"каноэ", "алоэ",
	// на ю
	"меню", "парвеню", "авеню", "дежавю", "инженю", "барбекю", "интервью",
})

var abnormalExceptions = str.NewWordMap(map[string][]string{
	"бремя":  {"бремя"},
	"вымя":   {"вымя"},
	"темя":   {"темя"},
	"пламя":  {"пламя"},
	"стремя": {"стремя"},
	"время":  {"время"},
	"знамя":  {"знамя"},
	"имя":    {"имя"},
	"племя":  {"племя"},
	"семя":   {"семя"},
	"путь":   {"путь", "пути", "пути", "путь", "путем", "пути"},
	"дитя":   {"дитя", "дитяти", "дитяти", "дитя", "дитятей", "дитяти"},
})

/** @var string[]  */
var masculineWithSoft = str.NewWordSet([]string{
	"автослесарь",
	"библиотекарь",
	"водитель",
	"воспитатель",
	"врач",
	"выхухоль",
	"гвоздь",
	"делопроизводитель",
	"дождь",
	"заместитель",
	"зверь",
	"конь",
	"конь",
	"лось",
	"медведь",
	"модуль",
	"олень",
	"пекарь",
	"пельмень",
	"председатель",
	"представитель",
	"преподаватель",
	"продавец",
	"производитель",
	"путь",
	"рояль",
	"рубль",
	"руководитель",
	"секретарь",
	"слесарь",
	"строитель",
	"табель",
	"токарь",
	"тюлень",
	"учитель",
	"циркуль",
	"шампунь",
	"шкворень",
	"юань",
	"ячмень",
})

/** @var string[]  */
var masculineWithSoftAndRunAwayVowels = str.NewWordSet([]string{
	"день",
	"пень",
	"парень",
	"камень",
	"корень",
	"трутень",
})
